Revit 2024 API
HostObjectSubcomponentInfo Properties
The HostObjectSubcomponentInfo type exposes the following members.
Properties
Name | Description
AreaOfCurveLoop
 The area of the CurveLoop of the roof or floor slab.
Depth
 The depth of the roof or floor slab.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LoopFace
 The face of the loops of the roof or floor slab.
See Also
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace